{
  "aboutMe": "About Me",
  "about": "About",
  "education": "Education",
  "skills": "Skills",
  "experience": "Experience",
  "projects": "Projects",
  "contact": "Contact",
  "hi": "HI",
  "iAm": "I AM",
  "uiUxDesignerAndWebDeveloper": "UI/UX Designer And Web Developer",
  "downloadResume": "Download Resume",
  "copyright": "copyright",
  "designAndDevelopedBy": "Design and developed by",
  "aboutParagraph1": "Energetic and self-motivated Computer Science graduate with apassion for web development. Skilled in front-end and full-stackdevelopment. A dedicated, versatile team player with a can-doattitude and a strong drive for continuous personal andprofessional growth.",
  "aboutParagraph2a": "With experience in Agile team, I have developed strongcollaboration and problem-solving skills. My work involvesfront-end and back-end development using React TypeScript,# .NET, and PostgreSQL to create robust full-stackapplications. I have effectively utilized Git for teamworkand collaboration, ensuring clean, scalable code andseamless integration in multi-developer environments.Teadiscussions and collaborative workflows are where I thrive,and I value on-site roles that encourage teamwork and opencommunication.",
  "aboutParagraph2b": "A strong interest in data science and artificialintelligence drives my continuous learning. Advanced coursesin machine learning and deep learning have enhanced myknowledge, while my internship at SAMK provided hands-onexperience in data analysis and predictive modeling. Writingblogs and sharing insights has further strengthened myunderstanding and passion for these fields.",
  "aboutParagraph2c": "Fluency in English and conversational skills in Finnishsupport my ability to work in diverse teams, with a keeninterest in Finnish-speaking workplaces to improve mylanguage skills and cultural integration. Outside of myprofessional life, gardening and handcraft activities allowme to express creativity and attention to detail, bringingbalance and fulfillment to my daily routine.",
  "aboutParagraph2ReadLess": "With experience in Agile team, I have developed strongcollaboration and problem-solving skills. My work involvesfront-end and back-end development using React TypeScript,C# .NET, and PostgreSQL to create robust full-stack\n                    applications.",
  "readLess": "Read Less",
  "readMore": "Read More",
  "bachelorDegreeExplanation": "Learned fundamental and advanced concepts in numerical methods, software development, and programming, gaining expertise in designing and implementing software solutions and solving computational problems.",
  "sataeduExperienceExplanation": "Achieving B2.2 proficiency in Finnish, gaining insights into Finnish culture, and acquiring work experience in a Finnish work environment.",
  "bearitExperienceExplanation": "Gained insights from Finnish IT companies, collaborated in a team to develop modern software solutions, improved Finnish language proficiency, and learned software development tools from Udemy platform.",
  "sataeduCourseName": "Finnish Language skills and Intregation Course",
  "bearitCourseName": "LearnIT - Coding and Finnish Language at BearIT Tampere",
  "programmingLanguagesAndTools": "Programming Languages and Tools",
  "languageSkills": "Language Skills",
  "codecontrolExperienceExplanation": "Designing web application layouts in Figma, developing front-end in React Typescript with Tailwind CSS and Material UI. Backend development with C# .Net and Entity Framework Core using PostgreSQL for Web API solution.",
  "learnITExperienceExplanation": "Collaborated as part of a team to build the Mittwatt application in Agile working methodology. Developed an electricity price prediction model in Python. Gained proficiency in Bitbucket, PostgreSQL, JavaScript, teamwork, and project management.",
  "tupseDesignExperienceExplanation": "Frontend development using SvelteKit and Tailwind CSS.",
  "samkExperienceExplanation": "Data analysis and implementing machine learning models in synthetic LIBS datasets. Designing web apps in ReactJS.",
  "edasExperienceExplanation": "Major contribution in chapters \"Data Wrangling\" and \"Model Development and Evaluation\" in book \"Hands-On Exploratory Data Analysis with Python eBook\" by Packt Publication.",
  "softedgeExperienceExplanation": "Web Developer. Worked with web-based applications in ASP .Net MVC framework.",
  "name": "Name",
  "email": "Email",
  "Subject": "Subject",
  "Message": "Message",
  "Submit": "Submit",
  "webDeveloper": "Web Developer",
  "website": "Website"
}
