{
  "aboutMe": "About Me",
  "about": "About",
  "education": "Education",
  "skills": "Skills",
  "experience": "Experience",
  "projects": "Projects",
  "contact": "Contact",
  "hi": "HI",
  "iAm": "I AM",
  "uiUxDesignerAndWebDeveloper": "UI/UX Designer And Web Developer",
  "downloadResume": "Download Resume",
  "copyright": "copyright",
  "designAndDevelopedBy": "Design and developed by",
  "aboutParagraph1": "Energetic and self-motivated Computer Science graduate with a passion for web development. Skilled in front-end and full-stack development. A dedicated, versatile team player with a can-do attitude and a strong drive for continuous personal and professional growth.",
  "aboutParagraph2a": "With experience in an Agile team, I have developed strong collaboration and problem-solving skills. My work involves front-end and back-end development using React TypeScript, C# .NET, and PostgreSQL to create robust full-stack applications. I have effectively utilized Git for teamwork and collaboration, ensuring clean, scalable code and seamless integration in multi-developer environments. Tea discussions and collaborative workflows are where I thrive, and I value on-site roles that encourage teamwork and open communication.",
  "aboutParagraph2b": "A strong interest in data science and artificial intelligence drives my continuous learning. Advanced courses in machine learning and deep learning have enhanced my knowledge, while my internship at SAMK provided hands-on experience in data analysis and predictive modeling. Writing blogs and sharing insights has further strengthened my understanding and passion for these fields.",
  "aboutParagraph2c": "Fluency in English and conversational skills in Finnish support my ability to work in diverse teams, with a keen interest in Finnish-speaking workplaces to improve my language skills and cultural integration. Outside of my professional life, gardening and handcraft activities allow me to express creativity and attention to detail, bringing balance and fulfillment to my daily routine.",
  "aboutParagraph2ReadLess": "With experience in an Agile team, I have developed strong collaboration and problem-solving skills. My work involves front-end and back-end development using React TypeScript, C# .NET, and PostgreSQL to create robust full-stack applications.",
  "readLess": "Read Less",
  "readMore": "Read More",
  "bachelorDegreeExplanation": "Learned fundamental and advanced concepts in numerical methods, software development, and programming, gaining expertise in designing and implementing software solutions and solving computational problems.",
  "sataeduExperienceExplanation": "Achieving B2.2 proficiency in Finnish, gaining insights into Finnish culture, and acquiring work experience in a Finnish work environment.",
  "bearitExperienceExplanation": "Gained insights from Finnish IT companies, collaborated in a team to develop modern software solutions, improved Finnish language proficiency, and learned software development tools from Udemy platform.",
  "sataeduCourseName": "Finnish Language skills and Intregation Course",
  "bearitCourseName": "LearnIT - Coding and Finnish Language at BearIT Tampere",
  "programmingLanguagesAndTools": "Programming Languages and Tools",
  "languageSkills": "Language Skills",
  "codecontrolExperienceExplanation": "Designing web application layouts in Figma, developing front-end in React Typescript with Tailwind CSS and Material UI. Backend development with C# .Net and Entity Framework Core using PostgreSQL for Web API solution.",
  "learnITExperienceExplanation": "Collaborated as part of a team to build the Mittwatt application in Agile working methodology. Developed an electricity price prediction model in Python. Gained proficiency in Bitbucket, PostgreSQL, JavaScript, teamwork, and project management.",
  "tupseDesignExperienceExplanation": "Frontend development using SvelteKit and Tailwind CSS.",
  "samkExperienceExplanation": "Data analysis and implementing machine learning models in synthetic LIBS datasets. Designing web apps in ReactJS.",
  "edasExperienceExplanation": "Major contribution in chapters \"Data Wrangling\" and \"Model Development and Evaluation\" in book \"Hands-On Exploratory Data Analysis with Python eBook\" by Packt Publication.",
  "softedgeExperienceExplanation": "Web Developer. Worked with web-based applications in ASP .Net MVC framework.",
  "name": "Name",
  "email": "Email",
  "Subject": "Subject",
  "Message": "Message",
  "Submit": "Submit",
  "webDeveloper": "Web Developer",
  "website": "Website",
  "messageSentSuccessfully": "Message Sent Sucessfully!",
  "messageFailedToSend": "Please try to send again later!",
  "portfolioWebsitForClient": "Portfolio website for client in React TypeScript",
  "personalPrtfolioWebsite": "My Personal portfolio website in React TypeScript",
  "myPersonalPrtfolioWebsite": "My Personal portfolio website in React TypeScript",
  "bookStoreAppDiscription": "Full-stack MERN application for managing books with CRUD operations.",
  "thingsToDoProjectExplanation": "Full-stack todo list application in React JavaScript.",
  "tenziesGameProjectExplanation": "Single page Tenzies game application in React JavaScript."
}
