{
  "aboutMe": "Minusta",
  "about": "Minusta",
  "education": "Koulutus",
  "skills": "Osaaminen",
  "experience": "Työkokemus",
  "projects": "Projektit",
  "contact": "Ota yhteyttä",
  "hi": "Hei",
  "iAm": "olen",
  "uiUxDesignerAndWebDeveloper": "UI/UX Suunnittelija Ja Web Kehittäjä",
  "downloadResume": "Lataa CV",
  "designAndDevelopedBy": "Suunnittelu ja kehitys",
  "aboutParagraph1": "Energinen ja oma-aloitteinen tietojenkäsittelytieteen kandidaatti, jolla on intohimo web-kehitykseen. Taitava frontend- ja full stack -kehityksessä. Omistautunut ja monipuolinen tiimipelaaja, jolla on positiivinen asenne ja vahva halu kehittyä jatkuvasti niin ammatillisesti kuin henkilökohtaisestikin.",
  "aboutParagraph2a": "Kokemukseni ketterässä (Agile) tiimissä on kehittänyt vahvoja yhteistyö- ja ongelmanratkaisutaitoja. Työni sisältää sekä front-end- että back-end-kehitystä hyödyntäen React TypeScriptiä, C# .NET:iä ja PostgreSQL:ää täysiveristen full stack -sovellusten rakentamiseen. Olen hyödyntänyt Git-versiohallintaa tehokkaasti tiimityössä ja yhteistyössä, varmistaen selkeän, skaalautuvan koodin ja sujuvan integraation usean kehittäjän ympäristössä. Viihdyn erityisesti tiimikeskusteluissa ja yhteistyöpainotteisissa prosesseissa, ja arvostan työpaikkoja, joissa panostetaan tiimityöhön ja avoimeen viestintään.",
  "aboutParagraph2b": "Vahva kiinnostukseni data-analytiikkaan ja tekoälyyn motivoi minua jatkuvaan oppimiseen. Syventävät kurssit koneoppimisessa ja syväoppimisessa ovat laajentaneet osaamistani, ja harjoitteluni SAMKissa antoi käytännön kokemusta data-analyysistä ja ennakoivasta mallinnuksesta. Blogien kirjoittaminen ja oivallusten jakaminen on entisestään syventänyt ymmärrystäni ja intohimoani näitä aloja kohtaan.",
  "aboutParagraph2c": "Sujuva englannin kielen taitoni ja keskustelutaitoni suomeksi tukevat kykyäni työskennellä monimuotoisissa tiimeissä. Olen erityisen kiinnostunut suomenkielisistä työympäristöistä, jotta voin kehittää kielitaitoani ja integroitua paremmin suomalaiseen kulttuuriin. Ammatillisen elämän ulkopuolella puutarhanhoito ja käsityöt antavat minulle mahdollisuuden ilmaista luovuutta ja tarkkuutta, tuoden tasapainoa ja mielekkyyttä arkeen.",
  "aboutParagraph2ReadLess": "Kokemus ketterästä (Agile) tiimityöskentelystä on kehittänyt vahvat yhteistyö- ja ongelmanratkaisutaitoni. Työni kattaa sekä front-end- että back-end-kehityksen, ja käytän teknologioina React TypeScriptiä, C# .NET:iä ja PostgreSQL:ää vankkojen full stack -sovellusten rakentamiseen.\n\n",
  "readLess": "Lue vähemmän",
  "readMore": "Lue lisää",
  "bachelorDegreeExplanation": "Olen oppinut numeeristen menetelmien, ohjelmistokehityksen ja ohjelmoinnin perus- ja syventäviä konsepteja, saavuttaen osaamista ohjelmistoratkaisujen suunnittelussa ja toteutuksessa sekä laskennallisten ongelmien ratkaisemisessa.",
  "sataeduExperienceExplanation": "Saavutin suomen kielen B2.2-tason, sain ymmärrystä suomalaisesta kulttuurista ja hankin työkokemusta suomalaisessa työympäristössä.",
  "bearitExperienceExplanation": "Sain arvokkaita näkemyksiä suomalaisilta IT-yrityksiltä, tein tiimityötä modernien ohjelmistoratkaisujen kehittämiseksi, paransin suomen kielen taitoani ja opiskelin ohjelmistokehitystyökaluja Udemy-alustan kautta.",
  "sataeduCourseName": "Suomen kielen taidot ja kotoutumiskurssi",
  "bearitCourseName": "LearnIT – Ohjelmointia ja suomen kieltä BearIT, Tampere",
  "programmingLanguagesAndTools": "Ohjelmointikielet ja Työkalut",
  "languageSkills": "Kielitaito",
  "codecontrolExperienceExplanation": "Verkkosovellusten käyttöliittymien suunnittelu Figma-työkalulla, front-end-kehitys React TypeScriptillä käyttäen Tailwind CSS:ää ja Material UI:ta. Back-end-kehitys C# .NET:llä ja Entity Framework Corella, PostgreSQL-tietokantaa hyödyntäen Web API -ratkaisussa.",
  "learnITExperienceExplanation": "Tein tiimityötä Mittwatt-sovelluksen kehittämisessä ketterän (Agile) työskentelymenetelmän mukaisesti. Kehitin sähkön hinnan ennustusmallin Pythonilla. Kehitin osaamistani Bitbucketin, PostgreSQL:n, JavaScriptin, tiimityöskentelyn ja projektinhallinnan parissa.",
  "tupseDesignExperienceExplanation": "Front-end-kehitys SvelteKitillä ja Tailwind CSS:llä.",
  "samkExperienceExplanation": "Data-analyysi ja koneoppimismallien toteuttaminen synteettisillä LIBS-dataseteillä. Verkkosovellusten suunnittelu ReactJS:llä.",
  "edasExperienceExplanation": "Merkittävä panos luvuissa \"Data Wrangling\" ja \"Mallin kehittäminen ja arviointi\" kirjassa \"Hands-On Exploratory Data Analysis with Python eBook\" (Packt Publishing).",
  "softedgeExperienceExplanation": "Web-kehittäjä. Työskennellyt web-pohjaisten sovellusten parissa ASP .Net MVC -kehysmallissa.\n\n",
  "name": "Nimi",
  "email": "Sähköposti",
  "Subject": "Aihe",
  "Message": "Viesti",
  "Submit": "Lähettää",
  "webDeveloper": "Web kehittäjä",
  "website": "Verkkosivusto",
  "messageSentSuccessfully": "Viesti lähetettiin menestyksekkäästi!",
  "messageFailedToSend": "Yritä lähettää myöhemmin uudelleen!"
}
